In [2]:
import os
import pandas as pd
import geopandas as gpd

import numpy as np

In [3]:
path = os.path.join('i2p_data','listing') # A default location to save raw data
fn=['2015-05-listings.csv','2016-06-listings.csv','2017-03-listings.csv','2018-05-listings.csv','2019-04-listings.csv']

In [4]:
cols=['id','host_id','host_since','first_review', 'last_review','latitude', 'longitude']
df15 = pd.read_csv(os.path.join(path,fn[0]), low_memory=False, usecols=cols)
df16 = pd.read_csv(os.path.join(path,fn[1]), low_memory=False, usecols=cols)
df17 = pd.read_csv(os.path.join(path,fn[2]), low_memory=False, usecols=cols)
df18 = pd.read_csv(os.path.join(path,fn[3]), low_memory=False, usecols=cols)
df19 = pd.read_csv(os.path.join(path,fn[4]), low_memory=False, usecols=cols)
print(f"Data frame is {df15.shape[0]:,} x {df15.shape[1]}") 
print(f"Data frame is {df16.shape[0]:,} x {df16.shape[1]}") 
print(f"Data frame is {df17.shape[0]:,} x {df17.shape[1]}") 
print(f"Data frame is {df18.shape[0]:,} x {df18.shape[1]}") 
print(f"Data frame is {df19.shape[0]:,} x {df19.shape[1]}")

Data frame is 18,436 x 7
Data frame is 42,646 x 7
Data frame is 53,904 x 7
Data frame is 69,886 x 7
Data frame is 79,671 x 7

In [5]:
frame=[df15,df16,df17,df18,df19]

In [6]:
for i in frame:
    i.drop(i[i.id.isna()].index.values, axis=0, inplace=True)
    print(f"Data frame is {i.shape[0]:,} x {i.shape[1]}")

Data frame is 18,436 x 7
Data frame is 42,646 x 7
Data frame is 53,904 x 7
Data frame is 69,886 x 7
Data frame is 79,671 x 7

In [7]:
df16.head()

,id,host_id,host_since,latitude,longitude,first_review,last_review
0,6781198,21869529,2014-09-28,51.398883,-0.278265,2015-07-24,2016-01-09
1,5290274,27396120,2015-02-08,51.421111,-0.280557,2015-04-06,2015-05-12
2,4023781,20860377,2014-09-02,51.414036,-0.286075,2014-10-05,2015-12-19
3,5098744,26345340,2015-01-19,51.413899,-0.306505,2015-02-28,2016-02-18
4,11093420,52632402,2015-12-29,51.408234,-0.291167,2016-02-09,2016-04-01

In [8]:
listing15 = gpd.GeoDataFrame(df15,geometry=gpd.points_from_xy(df15.longitude,df15.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing16 = gpd.GeoDataFrame(df16,geometry=gpd.points_from_xy(df16.longitude,df16.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing17 = gpd.GeoDataFrame(df17,geometry=gpd.points_from_xy(df17.longitude,df17.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing18 = gpd.GeoDataFrame(df18,geometry=gpd.points_from_xy(df18.longitude,df18.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing19 = gpd.GeoDataFrame(df19,geometry=gpd.points_from_xy(df19.longitude,df19.latitude,crs='epsg:4326')).to_crs('epsg:27700')
    #gdf=gpd.sjoin(boro, listing, how='inner').drop(columns=['latitude','longitude','index_right'])
    #gdf_1 = gdf.groupby('GSS_CODE')['id'].agg(Number_of_Listings_2015='count').reset_index()

In [9]:
boro = gpd.read_file(os.path.join('data','geo','Boroughs.gpkg'), driver='GPKG')

In [10]:
listings=[listing15,listing16,listing17,listing18,listing19]

In [11]:
gdf15=gpd.sjoin(boro, listing15, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf16=gpd.sjoin(boro, listing16, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf17=gpd.sjoin(boro, listing17, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf18=gpd.sjoin(boro, listing18, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf19=gpd.sjoin(boro, listing19, how='inner').drop(columns=['latitude','longitude','index_right'])

In [18]:
gdf15_1 = gdf15.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf16_1 = gdf16.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf17_1 = gdf17.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf18_1 = gdf18.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf19_1 = gdf19.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index()

In [19]:
df15_1 = pd.DataFrame(gdf15_1)
df16_1 = pd.DataFrame(gdf16_1)
df17_1 = pd.DataFrame(gdf17_1)
df18_1 = pd.DataFrame(gdf18_1)
df19_1 = pd.DataFrame(gdf19_1)

In [20]:
a='Year'
df15_1[a]=2015
df16_1[a]=2016
df17_1[a]=2017
df18_1[a]=2018
df19_1[a]=2019

In [23]:
frame1=[df15_1,df16_1,df17_1,df18_1,df19_1]
Airbnb_listing = pd.concat(frame1)

In [24]:
Airbnb_listing

     GSS_CODE  Number_of_Listings  Year
0   E09000001                 118  2015
1   E09000002                   7  2015
2   E09000003                  65  2015
3   E09000004                   5  2015
4   E09000005                 146  2015
..        ...                 ...   ...
28  E09000029                 252  2019
29  E09000030                7653  2019
30  E09000031                1292  2019
31  E09000032                4041  2019
32  E09000033                8863  2019

[163 rows x 3 columns]

### Education

In [3]:
path = os.path.join('i2p_data','demographic')
fn=['crime-rates.csv','education.csv','income-of-tax-payers.csv']

In [3]:
#df_cr = pd.read_csv(os.path.join(path,fn[0]), low_memory=False)
df_ed = pd.read_csv(os.path.join(path,fn[1]), low_memory=False)
#df_in = pd.read_csv(os.path.join(path,fn[2]), low_memory=False)

#print(f"Data frame is {df_cr.shape[0]:,} x {df_cr.shape[1]}") 
print(f"Data frame is {df_ed.shape[0]:,} x {df_ed.shape[1]}") 
#print(f"Data frame is {df_in.shape[0]:,} x {df_in.shape[1]}")

Data frame is 5,558 x 8
Data frame is 52 x 56

In [42]:
df_ed.head()

,Code,Area,Year,Qualifications of working age population (16-64),number,denominator,percent,confidence
0,E09000001,City of London,2004,NVQ4+,"3,500","4,300",80.6,*
1,E09000002,Barking and Dagenham,2004,NVQ4+,"14,300","101,800",14.1,3
2,E09000003,Barnet,2004,NVQ4+,"77,100","206,600",37.3,4
3,E09000004,Bexley,2004,NVQ4+,"21,400","134,900",15.8,3.3
4,E09000005,Brent,2004,NVQ4+,"43,800","178,400",24.5,3.4

In [4]:
search ='E09'
E09=df_ed['Code'].str.startswith(search) 
df_ed[E09]

,Code,Area,Year,Qualifications of working age population (16-64),number,denominator,percent,confidence
0,E09000001,City of London,2004,NVQ4+,"3,500","4,300",80.6,*
1,E09000002,Barking and Dagenham,2004,NVQ4+,"14,300","101,800",14.1,3
2,E09000003,Barnet,2004,NVQ4+,"77,100","206,600",37.3,4
3,E09000004,Bexley,2004,NVQ4+,"21,400","134,900",15.8,3.3
4,E09000005,Brent,2004,NVQ4+,"43,800","178,400",24.5,3.4
...,...,...,...,...,...,...,...,...
5537,E09000029,Sutton,2019,no qualifications,9800,131800,7.4,2.3
5538,E09000030,Tower Hamlets,2019,no qualifications,22800,235600,9.7,2.9
5539,E09000031,Waltham Forest,2019,no qualifications,16800,188900,8.9,3
5540,E09000032,Wandsworth,2019,no qualifications,9800,235200,4.1,2
5541,E09000033,Westminster,2019,no qualifications,9900,172200,5.8,2.5

In [5]:
NVQ4 = df_ed[E09][(df_ed[E09]['Qualifications of working age population (16-64)']=='NVQ4+')]
NVQ4

,Code,Area,Year,Qualifications of working age population (16-64),number,denominator,percent,confidence
0,E09000001,City of London,2004,NVQ4+,"3,500","4,300",80.6,*
1,E09000002,Barking and Dagenham,2004,NVQ4+,"14,300","101,800",14.1,3
2,E09000003,Barnet,2004,NVQ4+,"77,100","206,600",37.3,4
3,E09000004,Bexley,2004,NVQ4+,"21,400","134,900",15.8,3.3
4,E09000005,Brent,2004,NVQ4+,"43,800","178,400",24.5,3.4
...,...,...,...,...,...,...,...,...
5243,E09000029,Sutton,2019,NVQ4+,60500,131800,45.9,4.3
5244,E09000030,Tower Hamlets,2019,NVQ4+,142500,235600,60.5,4.8
5245,E09000031,Waltham Forest,2019,NVQ4+,94800,188900,50.2,5.2
5246,E09000032,Wandsworth,2019,NVQ4+,168300,235200,71.6,4.5
5247,E09000033,Westminster,2019,NVQ4+,112700,172200,65.5,5.1

In [9]:
NVQ4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 495 entries, 0 to 5247
Data columns (total 8 columns):
 #   Column                                            Non-Null Count  Dtype
---  ------                                            --------------  -----
 0   Code                                              495 non-null    object
 1   Area                                              495 non-null    object
 2   Year                                              495 non-null    int64
 3   Qualifications of working age population (16-64)  495 non-null    object
 4   number                                            495 non-null    object
 5   denominator                                       495 non-null    object
 6   percent                                           495 non-null    object
 7   confidence                                        495 non-null    object
dtypes: int64(1), object(7)
memory usage: 34.8+ KB

In [11]:
df_edu = NVQ4[NVQ4.Year>2014][['Code','Area','Year','Qualifications of working age population (16-64)','percent']]
df_edu

,Code,Area,Year,Qualifications of working age population (16-64),percent
3815,E09000001,City of London,2015,NVQ4+,80
3816,E09000002,Barking and Dagenham,2015,NVQ4+,32.4
3817,E09000003,Barnet,2015,NVQ4+,49.1
3818,E09000004,Bexley,2015,NVQ4+,33.6
3819,E09000005,Brent,2015,NVQ4+,45.1
...,...,...,...,...,...
5243,E09000029,Sutton,2019,NVQ4+,45.9
5244,E09000030,Tower Hamlets,2019,NVQ4+,60.5
5245,E09000031,Waltham Forest,2019,NVQ4+,50.2
5246,E09000032,Wandsworth,2019,NVQ4+,71.6
5247,E09000033,Westminster,2019,NVQ4+,65.5

In [30]:
#df_ed_ = df_ed.groupby(['Code','Area','Year','Qualifications of working age population (16-64)'])

### income

In [103]:
df_in = pd.read_csv(os.path.join(path,fn[2]), low_memory=False,header=[1])  
print(f"Data frame is {df_in.shape[0]:,} x {df_in.shape[1]}")

Data frame is 51 x 56

In [78]:
print(df_in.columns.get_level_values(0))

Index(['Code', 'Area', 'Number of Individuals', 'Mean ?', 'Median ?',
       'Number of Individuals.1', 'Mean ?.1', 'Median ?.1',
       'Number of Individuals.2', 'Mean ?.2', 'Median ?.2',
       'Number of Individuals.3', 'Mean ?.3', 'Median ?.3',
       'Number of Individuals.4', 'Mean ?.4', 'Median ?.4',
       'Number of Individuals.5', 'Mean ?.5', 'Median ?.5',
       'Number of Individuals.6', 'Mean ?.6', 'Median ?.6',
       'Number of Individuals.7', 'Mean ?.7', 'Median ?.7',
       'Number of Individuals.8', 'Mean ?.8', 'Median ?.8',
       'Number of Individuals.9', 'Mean ?.9', 'Median ?.9',
       'Number of Individuals.10', 'Mean ?.10', 'Median ?.10',
       'Number of Individuals.11', 'Mean ?.11', 'Median ?.11',
       'Number of Individuals.12', 'Mean ?.12', 'Median ?.12',
       'Number of Individuals.13', 'Mean ?.13', 'Median ?.13',
       'Number of Individuals.14', 'Mean ?.14', 'Median ?.14',
       'Number of Individuals.15', 'Mean ?.15', 'Median ?.15',
       'Number of Individuals.16', 'Mean ?.16', 'Median ?.16',
       'Number of Individuals.17', 'Mean ?.17', 'Median ?.17'],
      dtype='object')

In [79]:
df_in[['Median ?']].head(3)

  Median ?
0      NaN
1   40,400
2   15,100

In [88]:
df_in.head()

,Code,Area,Number of Individuals,Mean ?,Median ?,Number of Individuals.1,Mean ?.1,Median ?.1,Number of Individuals.2,Mean ?.2,...,Median ?.14,Number of Individuals.15,Mean ?.15,Median ?.15,Number of Individuals.16,Mean ?.16,Median ?.16,Number of Individuals.17,Mean ?.17,Median ?.17
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,E09000001,City of London,"10,000","109,800","40,400","10,000","137,000","65,000","12,000","92,900",...,"61,100","10,000","142,000","60,000","12,000","157,000","57,300","11,000","148,000","60,000"
2,E09000002,Barking and Dagenham,"62,000","16,200","15,100","71,000","18,100","15,600","56,000","18,600",...,"21,800","83,000","25,900","22,100","88,000","26,700","23,300","85,000","27,400","23,900"
3,E09000003,Barnet,"161,000","26,800","18,700","156,000","30,800","19,400","159,000","30,400",...,"27,100","178,000","49,000","27,700","180,000","48,600","28,800","188,000","49,500","28,700"
4,E09000004,Bexley,"105,000","20,500","17,200","116,000","19,800","17,300","112,000","22,000",...,"24,400","127,000","30,900","24,500","125,000","32,300","26,100","122,000","33,500","26,900"

In [126]:
df1_in=df_in.iloc[:,-12:]

In [127]:
df1_in['GSS_CODE']=df_in.Code
df1_in['Borough']=df_in.Area

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [119]:
df1_in.head()

,Number of Individuals.14,Mean ?.14,Median ?.14,Number of Individuals.15,Mean ?.15,Median ?.15,Number of Individuals.16,Mean ?.16,Median ?.16,Number of Individuals.17,Mean ?.17,Median ?.17
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"9,000","144,000","61,100","10,000","142,000","60,000","12,000","157,000","57,300","11,000","148,000","60,000"
2,"74,000","25,500","21,800","83,000","25,900","22,100","88,000","26,700","23,300","85,000","27,400","23,900"
3,"175,000","45,800","27,100","178,000","49,000","27,700","180,000","48,600","28,800","188,000","49,500","28,700"
4,"122,000","30,200","24,400","127,000","30,900","24,500","125,000","32,300","26,100","122,000","33,500","26,900"

In [94]:
df1_in.columns

Index(['Number of Individuals.14', 'Mean ?.14', 'Median ?.14',
       'Number of Individuals.15', 'Mean ?.15', 'Median ?.15',
       'Number of Individuals.16', 'Mean ?.16', 'Median ?.16',
       'Number of Individuals.17', 'Mean ?.17', 'Median ?.17', 'GSS_CODE',
       'Borough'],
      dtype='object')

In [128]:
df1_in.drop(['Number of Individuals.14', 'Mean ?.14',
       'Number of Individuals.15', 'Mean ?.15', 
       'Number of Individuals.16', 'Mean ?.16', 
       'Number of Individuals.17', 'Mean ?.17'],axis=1, inplace=True)

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\pandas\core\frame.py:4170: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [129]:
df1_in.head()

,Median ?.14,Median ?.15,Median ?.16,Median ?.17,GSS_CODE,Borough
0,NaN,NaN,NaN,NaN,NaN,NaN
1,"61,100","60,000","57,300","60,000",E09000001,City of London
2,"21,800","22,100","23,300","23,900",E09000002,Barking and Dagenham
3,"27,100","27,700","28,800","28,700",E09000003,Barnet
4,"24,400","24,500","26,100","26,900",E09000004,Bexley

In [130]:
df1_in.drop(df1_in[df1_in.Borough.isna()].index.values,axis=0, inplace=True)

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\pandas\core\frame.py:4170: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [132]:
df1_in.head()

,Median ?.14,Median ?.15,Median ?.16,Median ?.17,GSS_CODE,Borough
1,"61,100","60,000","57,300","60,000",E09000001,City of London
2,"21,800","22,100","23,300","23,900",E09000002,Barking and Dagenham
3,"27,100","27,700","28,800","28,700",E09000003,Barnet
4,"24,400","24,500","26,100","26,900",E09000004,Bexley
5,"22,700","23,200","24,100","24,700",E09000005,Brent

In [133]:
search ='E09'
E09=df1_in['GSS_CODE'].str.startswith(search) 
df1_in[E09]

,Median ?.14,Median ?.15,Median ?.16,Median ?.17,GSS_CODE,Borough
1,"61,100","60,000","57,300","60,000",E09000001,City of London
2,"21,800","22,100","23,300","23,900",E09000002,Barking and Dagenham
3,"27,100","27,700","28,800","28,700",E09000003,Barnet
4,"24,400","24,500","26,100","26,900",E09000004,Bexley
5,"22,700","23,200","24,100","24,700",E09000005,Brent
6,"28,100","29,800","30,400","32,000",E09000006,Bromley
7,"33,100","34,400","35,500","37,300",E09000007,Camden
8,"25,100","26,300","25,600","27,500",E09000008,Croydon
9,"24,600","24,900","26,100","26,700",E09000009,Ealing
10,"25,300","25,100","25,400","26,300",E09000010,Enfield
11,"24,600","25,600","26,000","27,600",E09000011,Greenwich
12,"26,000","27,800","28,000","29,400",E09000012,Hackney
13,"30,100","32,000","32,300","33,200",E09000013,Hammersmith and Fulham
14,"25,800","25,600","25,100","27,100",E09000014,Haringey
15,"26,100","26,300","27,300","27,600",E09000015,Harrow
16,"24,900","26,000","26,100","27,900",E09000016,Havering
17,"25,300","25,900","26,200","27,100",E09000017,Hillingdon
18,"24,700","25,000","26,100","26,400",E09000018,Hounslow
19,"31,000","31,100","32,900","33,400",E09000019,Islington
20,"38,700","37,500","39,500","40,400",E09000020,Kensington and Chelsea
21,"29,100","30,300","30,200","32,400",E09000021,Kingston-upon-Thames
22,"27,300","28,400","29,200","29,900",E09000022,Lambeth
23,"24,900","25,800","26,700","27,300",E09000023,Lewisham
24,"27,600","28,500","29,500","30,200",E09000024,Merton
25,"20,200","22,100","22,500","24,100",E09000025,Newham
26,"25,700","26,400","27,400","28,000",E09000026,Redbridge
27,"35,800","35,500","36,600","36,100",E09000027,Richmond-upon-Thames
28,"27,700","27,100","29,400","29,400",E09000028,Southwark
29,"25,900","27,400","27,300","28,200",E09000029,Sutton
30,"26,600","28,900","30,500","30,200",E09000030,Tower Hamlets
31,"22,700","23,900","24,500","25,500",E09000031,Waltham Forest
32,"32,900","34,200","35,000","34,500",E09000032,Wandsworth
33,"35,100","37,800","36,100","39,700",E09000033,Westminster

In [138]:
df15_in=df1_in[E09][['GSS_CODE','Borough']]
df15_in['Median_income']=df1_in['Median ?.14']
df15_in['Year']=2015
#df15_in

In [142]:
df16_in=df1_in[E09][['GSS_CODE','Borough']]
df16_in['Median_income']=df1_in['Median ?.15']
df16_in['Year']=2016
#df16_in

In [143]:
df17_in=df1_in[E09][['GSS_CODE','Borough']]
df17_in['Median_income']=df1_in['Median ?.16']
df17_in['Year']=2017
#df17_in

In [144]:
df18_in=df1_in[E09][['GSS_CODE','Borough']]
df18_in['Median_income']=df1_in['Median ?.17']
df18_in['Year']=2018
#df18_in

In [145]:
frame2=[df15_in,df16_in,df17_in,df18_in]
Income = pd.concat(frame2)
Income

     GSS_CODE               Borough Median_income  Year
1   E09000001        City of London       61,100   2015
2   E09000002  Barking and Dagenham       21,800   2015
3   E09000003                Barnet       27,100   2015
4   E09000004                Bexley       24,400   2015
5   E09000005                 Brent       22,700   2015
..        ...                   ...           ...   ...
29  E09000029                Sutton       28,200   2018
30  E09000030         Tower Hamlets       30,200   2018
31  E09000031        Waltham Forest       25,500   2018
32  E09000032            Wandsworth       34,500   2018
33  E09000033           Westminster       39,700   2018

[132 rows x 4 columns]

### crime rate

In [146]:
path = os.path.join('i2p_data','demographic')
fn=['crime-rates.csv','education.csv','income-of-tax-payers.csv']

In [217]:
df_cr = pd.read_csv(os.path.join(path,fn[0]), low_memory=False)
print(f"Data frame is {df_cr.shape[0]:,} x {df_cr.shape[1]}")

Data frame is 6,660 x 6

In [162]:
df_cr.head()

,GSS_CODE,Borough,Year,Offences,Rate,Number_of_offences
0,E09000002,Barking and Dagenham,1999-00,All recorded offences,120.5,"19,567"
1,E09000003,Barnet,1999-00,All recorded offences,98.0,"30,708"
2,E09000004,Bexley,1999-00,All recorded offences,95.1,"20,680"
3,E09000005,Brent,1999-00,All recorded offences,127.7,"33,253"
4,E09000006,Bromley,1999-00,All recorded offences,89.8,"26,474"

In [150]:
df_cr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6660 entries, 0 to 6659
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   GSS_CODE            6480 non-null   object
 1   Borough             6660 non-null   object
 2   Year                6660 non-null   object
 3   Offences            6660 non-null   object
 4   Rate                6411 non-null   float64
 5   Number_of_offences  6591 non-null   object
dtypes: float64(1), object(5)
memory usage: 312.3+ KB

In [218]:
df_cr.Year.values.astype('str')

array(['1999-00', '1999-00', '1999-00', ..., '2016-17', '2016-17',
       '2016-17'], dtype='<U9')

In [219]:
for i in range(0,6660):
    df_cr.Year[i]='20'+ df_cr.Year[i][-2:]

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [220]:
df_cr

,GSS_CODE,Borough,Year,Offences,Rate,Number_of_offences
0,E09000002,Barking and Dagenham,2000,All recorded offences,120.5,"19,567"
1,E09000003,Barnet,2000,All recorded offences,98.0,"30,708"
2,E09000004,Bexley,2000,All recorded offences,95.1,"20,680"
3,E09000005,Brent,2000,All recorded offences,127.7,"33,253"
4,E09000006,Bromley,2000,All recorded offences,89.8,"26,474"
...,...,...,...,...,...,...
6655,NaN,Heathrow,2017,Other Notifiable Offences,NaN,"1,081"
6656,E13000001,Inner London,2017,Other Notifiable Offences,1.7,"6,041"
6657,E13000002,Outer London,2017,Other Notifiable Offences,1.3,"6,637"
6658,E12000007,Met Police Area,2017,Other Notifiable Offences,1.6,"13,759"
6659,727,England and Wales,2017,Other Notifiable Offences,NaN,NaN

In [223]:
df1_cr=df_cr[(df_cr.Year=='2014') |(df_cr.Year=='2015')|(df_cr.Year=='2016')|(df_cr.Year=='2017')]

In [225]:
df2_cr=df1_cr[df1_cr.Offences=='All recorded offences'][['GSS_CODE','Borough','Year','Offences','Rate']]

In [229]:
df2_cr.drop(df2_cr[df2_cr.GSS_CODE.isna()].index.values,axis=0, inplace=True)

In [230]:
search ='E09'
E09=df2_cr['GSS_CODE'].str.startswith(search) 
df2_cr[E09]

      GSS_CODE               Borough  Year               Offences   Rate
518  E09000002  Barking and Dagenham  2014  All recorded offences   82.9
519  E09000003                Barnet  2014  All recorded offences   61.6
520  E09000004                Bexley  2014  All recorded offences   50.0
521  E09000005                 Brent  2014  All recorded offences   77.1
522  E09000006               Bromley  2014  All recorded offences   61.2
..         ...                   ...   ...                    ...    ...
656  E09000029                Sutton  2017  All recorded offences   45.0
657  E09000030         Tower Hamlets  2017  All recorded offences   85.3
658  E09000031        Waltham Forest  2017  All recorded offences   64.9
659  E09000032            Wandsworth  2017  All recorded offences   65.8
660  E09000033           Westminster  2017  All recorded offences  171.3

[128 rows x 5 columns]

In [241]:
df3_cr=df2_cr[E09]
df3_cr['Crime_Rate']=df2_cr[E09].Rate

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [243]:
df3_cr=df3_cr[['GSS_CODE','Borough','Year','Offences','Crime_Rate']]
df3_cr

      GSS_CODE               Borough  Year               Offences  Crime_Rate
518  E09000002  Barking and Dagenham  2014  All recorded offences        82.9
519  E09000003                Barnet  2014  All recorded offences        61.6
520  E09000004                Bexley  2014  All recorded offences        50.0
521  E09000005                 Brent  2014  All recorded offences        77.1
522  E09000006               Bromley  2014  All recorded offences        61.2
..         ...                   ...   ...                    ...         ...
656  E09000029                Sutton  2017  All recorded offences        45.0
657  E09000030         Tower Hamlets  2017  All recorded offences        85.3
658  E09000031        Waltham Forest  2017  All recorded offences        64.9
659  E09000032            Wandsworth  2017  All recorded offences        65.8
660  E09000033           Westminster  2017  All recorded offences       171.3

[128 rows x 5 columns]

### rents

In [20]:
path = os.path.join('i2p_data','rents')
fn='weekly-rents-borough.csv'

In [21]:
df_rent = pd.read_csv(os.path.join(path,fn), low_memory=False)
print(f"Data frame is {df_rent.shape[0]:,} x {df_rent.shape[1]}")

Data frame is 208 x 4

In [22]:
df_rent

      New Code                  Area  weekly-rent    year
0    E09000001        City of London       115.56  2014.0
1    E09000002  Barking and Dagenham       120.92  2014.0
2    E09000003                Barnet       123.29  2014.0
3    E09000004                Bexley       106.35  2014.0
4    E09000005                 Brent       118.15  2014.0
..         ...                   ...          ...     ...
203        NaN                   NaN          NaN     NaN
204        NaN                   NaN          NaN     NaN
205        NaN                   NaN          NaN     NaN
206        NaN                   NaN          NaN     NaN
207        NaN                   NaN          NaN     NaN

[208 rows x 4 columns]

In [23]:
df_rent.drop(df_rent[df_rent['New Code'].isna()].index.values,axis=0,inplace=True)

In [24]:
df_rent

      New Code                  Area  weekly-rent    year
0    E09000001        City of London       115.56  2014.0
1    E09000002  Barking and Dagenham       120.92  2014.0
2    E09000003                Barnet       123.29  2014.0
3    E09000004                Bexley       106.35  2014.0
4    E09000005                 Brent       118.15  2014.0
..         ...                   ...          ...     ...
193  E09000029                Sutton       117.09  2019.0
194  E09000030         Tower Hamlets       124.19  2019.0
195  E09000031        Waltham Forest       116.49  2019.0
196  E09000032            Wandsworth       128.01  2019.0
197  E09000033           Westminster       140.33  2019.0

[198 rows x 4 columns]

In [249]:
df_rent.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 198 entries, 0 to 197
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   New Code     198 non-null    object
 1   Area         198 non-null    object
 2   weekly-rent  198 non-null    float64
 3   year         198 non-null    float64
dtypes: float64(2), object(2)
memory usage: 7.7+ KB

In [25]:
#df_rent.year.astype('int')
df_rent['year'] = df_rent['year'].astype('int')

In [27]:
search ='E09'
E09=df_rent['New Code'].str.startswith(search) 
rent=df_rent[E09]

In [29]:
rent.sample(5)

      New Code                    Area  weekly-rent  year
32   E09000033             Westminster       122.03  2014
19   E09000020  Kensington and Chelsea       118.05  2014
170  E09000006                 Bromley       115.86  2019
146  E09000015                  Harrow       130.91  2018
109  E09000011               Greenwich       118.07  2017

### dwellings

In [3]:
path = os.path.join('i2p_data','dwellings')
fn='tenure-households-borough.csv'

In [4]:
cols=['Code','Name','Year','Tenure','Number_of_households','Percent_of_households_in_borough']
df_oo = pd.read_csv(os.path.join(path,fn), low_memory=False,usecols=cols)
print(f"Data frame is {df_oo.shape[0]:,} x {df_oo.shape[1]}")

Data frame is 3,120 x 6

In [6]:
df_oo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3120 entries, 0 to 3119
Data columns (total 6 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Code                              3120 non-null   object
 1   Name                              3120 non-null   object
 2   Year                              3120 non-null   int64
 3   Tenure                            3120 non-null   object
 4   Number_of_households              2556 non-null   object
 5   Percent_of_households_in_borough  3120 non-null   object
dtypes: int64(1), object(5)
memory usage: 146.4+ KB

In [5]:
df_oo

,Code,Name,Year,Tenure,Number_of_households,Percent_of_households_in_borough
0,E09000001,City of London,2018,Own.Outright,-,-
1,E09000002,Barking and Dagenham,2018,Own.Outright,15800,22
2,E09000003,Barnet,2018,Own.Outright,45900,31.7
3,E09000004,Bexley,2018,Own.Outright,36400,35.8
4,E09000005,Brent,2018,Own.Outright,22200,21.9
...,...,...,...,...,...,...
3115,E12000009,South West,2006,Total,NaN,100
3116,W92000004,Wales,2006,Total,NaN,100
3117,S92000003,Scotland,2006,Total,NaN,100
3118,N92000002,Northern Ireland,2006,Total,NaN,100
3119,K02000001,UK,2006,Total,NaN,100

In [7]:
df_oo.drop(df_oo[df_oo.Code.isna()].index.values,axis=0,inplace=True)

In [11]:
search ='E09'
E09=df_oo['Code'].str.startswith(search) 
df1_oo=df_oo[E09]

In [18]:
occupancy=df1_oo[(df1_oo.Tenure=='Own.Outright') & (df1_oo.Year>2014)]

In [19]:
occupancy

,Code,Name,Year,Tenure,Number_of_households,Percent_of_households_in_borough
0,E09000001,City of London,2018,Own.Outright,-,-
1,E09000002,Barking and Dagenham,2018,Own.Outright,15800,22
2,E09000003,Barnet,2018,Own.Outright,45900,31.7
3,E09000004,Bexley,2018,Own.Outright,36400,35.8
4,E09000005,Brent,2018,Own.Outright,22200,21.9
...,...,...,...,...,...,...
172,E09000029,Sutton,2015,Own.Outright,29000,36.3
173,E09000030,Tower Hamlets,2015,Own.Outright,12400,10.6
174,E09000031,Waltham Forest,2015,Own.Outright,18000,18.9
175,E09000032,Wandsworth,2015,Own.Outright,27100,21.5
176,E09000033,Westminster,2015,Own.Outright,18500,17.4

### housing stock

In [30]:
path = os.path.join('i2p_data','dwellings')
fn='Number-dwellings-borough.csv'

In [31]:
cols=['ONS code','Area name','2015','2016','2017','2018','2019']
df_sto = pd.read_csv(os.path.join(path,fn), low_memory=False,usecols=cols)
print(f"Data frame is {df_sto.shape[0]:,} x {df_sto.shape[1]}")

Data frame is 40 x 7

In [35]:
df_sto.drop(df_sto[df_sto['ONS code'].isna()].index.values,axis=0,inplace=True).set_index()

AttributeError: 'NoneType' object has no attribute 'set_index'

In [34]:
df_sto

,ONS code,Area name,2015,2016,2017,2018,2019
1,E09000001,City of London,"6,229","6,306","6,313","6,451","6,506"
2,E09000002,Barking and Dagenham,"73,182","73,914","74,510","74,923","75,829"
3,E09000003,Barnet,"145,272","146,730","148,529","150,737","152,946"
4,E09000004,Bexley,"96,996","96,864","97,628","97,905","98,391"
5,E09000005,Brent,"115,598","116,649","118,013","118,707","120,448"
6,E09000006,Bromley,"136,864","137,564","138,422","138,976","139,684"
7,E09000007,Camden,"101,653","102,618","103,826","104,771","105,598"
8,E09000008,Croydon,"152,515","154,559","157,394","159,470","161,060"
9,E09000009,Ealing,"130,528","131,249","132,094","133,551","135,305"
10,E09000010,Enfield,"123,799","124,471","125,369","125,755","126,255"
11,E09000011,Greenwich,"106,883","108,603","110,983","112,884","114,398"
12,E09000012,Hackney,"106,748","107,574","108,770","110,037","111,559"
13,E09000013,Hammersmith and Fulham,"85,267","85,635","86,609","88,140","89,186"
14,E09000014,Haringey,"106,640","106,879","107,620","108,820","109,388"
15,E09000015,Harrow,"88,414","89,324","89,980","90,680","91,909"
16,E09000016,Havering,"100,261","101,273","101,716","101,993","102,459"
17,E09000017,Hillingdon,"107,462","108,171","108,935","109,777","110,734"
18,E09000018,Hounslow,"98,787","99,267","99,824","100,735","101,838"
19,E09000019,Islington,"100,756","101,783","102,457","102,824","103,740"
20,E09000020,Kensington and Chelsea,"86,537","86,921","87,276","87,611","87,726"
21,E09000021,Kingston upon Thames,"66,412","66,651","66,924","67,141","67,642"
22,E09000022,Lambeth,"136,263","137,610","138,745","140,288","141,507"
23,E09000023,Lewisham,"122,818","124,357","125,961","126,487","128,115"
24,E09000024,Merton,"82,707","83,215","83,649","84,297","84,570"
25,E09000025,Newham,"108,810","110,251","112,628","114,474","116,979"
26,E09000026,Redbridge,"102,653","102,707","103,462","103,924","104,688"
27,E09000027,Richmond upon Thames,"83,781","84,294","84,759","85,141","85,564"
28,E09000028,Southwark,"128,358","129,740","132,152","132,970","136,178"
29,E09000029,Sutton,"81,237","81,628","82,281","82,978","83,553"
30,E09000030,Tower Hamlets,"110,791","113,185","118,012","120,015","121,539"
31,E09000031,Waltham Forest,"100,311","101,284","102,317","103,029","103,642"
32,E09000032,Wandsworth,"138,841","141,579","143,915","146,162","148,075"
33,E09000033,Westminster,"121,116","122,024","123,366","124,509","125,312"

In [45]:
df1_sto=df_sto[['ONS code','Area name']]
df2_sto=df_sto[['ONS code','Area name']]
df3_sto=df_sto[['ONS code','Area name']]
df4_sto=df_sto[['ONS code','Area name']]
df5_sto=df_sto[['ONS code','Area name']]

In [46]:
df1_sto['housing_stock']=df_sto['2015']
df2_sto['housing_stock']=df_sto['2016']
df3_sto['housing_stock']=df_sto['2017']
df4_sto['housing_stock']=df_sto['2018']
df5_sto['housing_stock']=df_sto['2019']

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [51]:
df1_sto['Year']=2015
df2_sto['Year']=2016
df3_sto['Year']=2017
df4_sto['Year']=2018
df5_sto['Year']=2019

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [52]:
frame3=[df1_sto,df2_sto,df3_sto,df4_sto,df5_sto]
housing_stock = pd.concat(frame3)

In [54]:
housing_stock

     ONS code             Area name housing_stock  Year
1   E09000001        City of London        6,229   2015
2   E09000002  Barking and Dagenham       73,182   2015
3   E09000003                Barnet      145,272   2015
4   E09000004                Bexley       96,996   2015
5   E09000005                 Brent      115,598   2015
..        ...                   ...           ...   ...
29  E09000029                Sutton       83,553   2019
30  E09000030         Tower Hamlets      121,539   2019
31  E09000031        Waltham Forest      103,642   2019
32  E09000032            Wandsworth      148,075   2019
33  E09000033           Westminster      125,312   2019

[165 rows x 4 columns]